In [55]:
import pandas as pd

In [56]:
a = pd.Series(['a','b','c'], index = [1,2,3])

In [62]:
a

1    a
2    b
3    c
dtype: object

In [58]:
test = {'Name' : ['John','Anna','Peter'],
       'Location' : ['New York','Paris','Berlin'],
       'Age' : [24,13,45]}

In [59]:
test_pd = pd.DataFrame(test)

In [60]:
test_pd

    Name  Location  Age
0   John  New York   24
1   Anna     Paris   13
2  Peter    Berlin   45

In [61]:
test_pd[test_pd.Age>15]

    Name  Location  Age
0   John  New York   24
2  Peter    Berlin   45

In [64]:
test_pd['Name']

0     John
1     Anna
2    Peter
Name: Name, dtype: object

In [69]:
test_pd[['Name','Location']][0:2]

   Name  Location
0  John  New York
1  Anna     Paris

In [72]:
test_pd[:2]

   Name  Location  Age
0  John  New York   24
1  Anna     Paris   13

In [73]:
test_pd[1:]

    Name Location  Age
1   Anna    Paris   13
2  Peter   Berlin   45

In [95]:
test_pd.iloc[[0,2],[0,2]]

    Name  Age
0   John   24
2  Peter   45

In [98]:
test_pd['Name'][0]

'John'

In [99]:
test_pd.iloc[[0,2],[1]]

   Location
0  New York
2    Berlin

In [101]:
test_pd.iloc[[0],[1]] = 'NewYork'

In [104]:
test_pd.loc[0:1,'Name':'Location']

   Name Location
0  John  NewYork
1  Anna    Paris

In [105]:
test_pd = pd.DataFrame(test_pd, columns = ['Name','Age','Location'])

In [106]:
test_pd

    Name  Age Location
0   John   24  NewYork
1   Anna   13    Paris
2  Peter   45   Berlin

In [107]:
test_pd = test_pd.reindex(index = [0,2,1])

In [108]:
test_pd

    Name  Age Location
0   John   24  NewYork
2  Peter   45   Berlin
1   Anna   13    Paris

In [109]:
test_pd['Hobby'] = ['Books','Cartoons','Moves']

In [110]:
test_pd

    Name  Age Location     Hobby
0   John   24  NewYork     Books
2  Peter   45   Berlin  Cartoons
1   Anna   13    Paris     Moves

In [114]:
test_pd.loc[3] = ['Alex',28,'Los Angeles','Books']

In [115]:
test_pd

    Name  Age     Location     Hobby
0   John   24      NewYork     Books
2  Peter   45       Berlin  Cartoons
1   Anna   13        Paris     Moves
3   Alex   28  Los Angeles     Books

In [116]:
test_pd.loc[5] = ['Alex',28,'Los Angeles','Books']

In [117]:
test_pd

    Name  Age     Location     Hobby
0   John   24      NewYork     Books
2  Peter   45       Berlin  Cartoons
1   Anna   13        Paris     Moves
3   Alex   28  Los Angeles     Books
5   Alex   28  Los Angeles     Books

In [118]:
test_pd.loc['go'] = ['Alex',28,'Los Angeles','Books']

In [121]:
test_pd = test_pd.drop('go',0)

In [122]:
test_pd = test_pd.drop(5,0)

In [123]:
test_pd

    Name  Age     Location     Hobby
0   John   24      NewYork     Books
2  Peter   45       Berlin  Cartoons
1   Anna   13        Paris     Moves
3   Alex   28  Los Angeles     Books